{"posts":[{"title":"What is Economy?","text":"Three Main Problems for Economy How People Make Decisions How People Interact How the Economy as a Whole Works Ten Principles of EconomyHow People Make Decisions People face tradeoffs. The cost of something is what you give up to get it. Rational people think at the margin. People respond to incentives. How People Interact Trade can make everyone better off. Markets are usually a good way to organize economic activity. Governments can sometimes improve market outcomes. How the Economy as a Whole Works The standard of living depends on a country’s production. Prices rise when the government prints too much money. Society faces a short-run tradeoff between inflation and unempolyment. 1. People face tradeoffsThere is no such thing as a free lunch! To get one thing, we usually have to give up another thing. 2. The cost of something is what you give up to get itThe opportunity cost of an item is what you give up to obtain that item. 3. Rational people think at the marginMarginal changes are small, incremental adjustments to an existing plan of action. 4. People respond to incentivesMarginal changes in costs or benefits motivate people to respond. The decision to choose one alternative over another occurs when that alternative’s marginal benefits exceed its marginal costs! 5. Trade can make everyone better offPeople gain from their ability to trade with one another. Competition results in gains from trading. Trade allows people to specialize in what they do best.","link":"/2025/09/13/economy_what_is_economy/"},{"title":"An Introduction to Sampling","text":"An Introduction to SamplingSampling algorithms provide efficient ways to generate samples from complex probability distributions. They are widely applied in areas such as Bayesian inference, optimization, physics, and machine learning, making them essential tools for connecting theory with practical data analysis. The Goal of SamplingThe goal of sampling is to generate random variable $X\\sim \\pi$ from a target distribution $\\pi$, typically known up to a normalization constant$$\\pi \\propto e^{-V(x)}$$","link":"/2025/09/14/sampling_introduction/"},{"title":"Hello Everyone","text":"Hello everyone! Welcome to my blog! I’ll be sharing my journey as a PhD student at the Academy of Mathematics and Systems Sciences, Chinese Academy of Sciences. This blog isn’t just about my math research – I’ll also explore topics like economics, finance, and anything else that sparks my interest! If you have any questions or just want to reach out, feel free to email me at wangtuo1020@outlook.com.","link":"/2025/09/11/hello/"}],"tags":[{"name":"Economy","slug":"Economy","link":"/tags/Economy/"},{"name":"Sampling","slug":"Sampling","link":"/tags/Sampling/"},{"name":"Optimization","slug":"Optimization","link":"/tags/Optimization/"},{"name":"Optimal Transport","slug":"Optimal-Transport","link":"/tags/Optimal-Transport/"},{"name":"Machine Learning","slug":"Machine-Learning","link":"/tags/Machine-Learning/"}],"categories":[{"name":"Economy","slug":"Economy","link":"/categories/Economy/"},{"name":"Sampling","slug":"Sampling","link":"/categories/Sampling/"}],"pages":[{"title":"About Me","text":"Hello","link":"/about.html"},{"title":"About Me","text":"Hello","link":"/about/about.html"}]}